tests/artillery/auth-flow.yml
config:
  target: "https://seedor-1.vercel.app"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Prueba de carga de autenticación"
  plugins:
    expect: {}
    
scenarios:
  - name: "Flujo de autenticación"
    flow:
      # Visitar página principal
      - get:
          url: "/"
          expect:
            - statusCode: 200
      
      # Visitar página de login
      - get:
          url: "/login"
          expect:
            - statusCode: 200
      
      # Intentar login con credenciales reales
      # Nota: Esto podría no funcionar si el formulario tiene protección CSRF
      - post:
          url: "/api/auth/login"
          json:
            email: "frantrivelloni@gmail.com"
            password: "12345678"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      
      # Visitar página de inicio después de login
      - get:
          url: "/home"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200