tests/artillery/basic-load.yml
config:
  target: "https://seedor-1.vercel.app"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warm up phase"
    - duration: 60
      arrivalRate: 5
      name: "Load test phase"
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "Navegación básica"
    flow:
      - get:
          url: "/"
          capture:
            - header: "set-cookie"
              as: "cookie_value"
          expect:
            - statusCode: 200
      
      - think: 2
      
      - get:
          url: "/login"
          headers:
            Cookie: "{{ cookie_value }}"
          expect:
            - statusCode: 200