tests/artillery/config.yaml
config:
  target: "https://seedor-1.vercel.app"
  phases:
    # Estos parámetros se sobrescribirán por los archivos específicos
    - duration: 60
      arrivalRate: 5
  environments:
    production:
      target: "https://seedor-1.vercel.app"
      phases:
        - duration: 60
          arrivalRate: 5
  http:
    # Tiempo de espera en milisegundos
    timeout: 10000
  processor: "./processor.js"
  plugins:
    metrics-by-endpoint: {}
    expect: {}