tests/artillery/config.yml
config:
  target: "https://seedor-1.vercel.app/"
  phases:
    - duration: 60
      arrivalRate: 2
      name: Test login con baja carga
  plugins:
    expect: {}
  
scenarios:
  - name: "Test de Login Simple"
    flow:
      - get:
          url: "/login"
          expect:
            - statusCode: 200
      - think: 1
      - post:
          url: "/api/auth/login"
          json:
            email: "demo@seedor.com"
            password: "demo123"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/home"
          expect:
            - statusCode: 200